<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Marcelo Alves de Sales">
   <meta name="GENERATOR" content="Mozilla/4.5 [en] (Win98; I) [Netscape]">
   <title>Grafos Orientados</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#FF0000" vlink="#FF0000" alink="#FF0000" background="bg3.jpg" bgproperties="fixed">
<b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

<font size=+1>Grafos Orientados</font></b>
<div ALIGN=right><table COLS=1 WIDTH="83%" >
<tr>
<td><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Para grafos
orientados, podemos tomar defini&ccedil;&otilde;es similares. Requeremos
que todas as extremidades em um caminho ou em um c&iacute;rculo tenham
a mesma dire&ccedil;&atilde;o, de forma que seguir um caminho ou um c&iacute;rculo
significa sempre mover-se na <font color="#FF0000">dire&ccedil;&atilde;o
indicada por setas</font>. Tal caminho (circulo) &eacute; chamado caminho
(c&iacute;rculo) orientado. Um grafo orientado &eacute; chamado de <font color="#FF0000">fortemente
conectado</font> se existe um caminho orientado de algum v&eacute;rtice
a qualquer outro v&eacute;rtice. Se suprimimos a dire&ccedil;&atilde;o
das extremidades e o grafo n&atilde;o orientado resultante &eacute; conectado,
podemos chamar o grafo orientado de <font color="#FF0000">fracamente orientado</font>.
Abaixo, a figura ilustra c&iacute;rculos orientados, grafos fortemente
orientados, e grafos fracamente orientados.&nbsp;</b></td>
</tr>
</table></div>
&nbsp;
<div ALIGN=right><table COLS=1 WIDTH="83%" >
<tr VALIGN=CENTER>
<td>
<center><img SRC="Tiposgrafos.gif" height=113 width=459></center>
</td>
</tr>
</table></div>

<div ALIGN=right><table COLS=1 WIDTH="83%" >
<tr>
<td><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Os grafos
orientados da figura acima mostram pares de v&eacute;rtices com extremidades
orientadas apontando ambos os caminhos entre eles. Desde que extremidades
orientadas s&atilde;o pares ordenados e pares ordenados ( v , w ) e ( w
, v ) s&atilde;o distintos se v &pound; w, tais pares de extremidades s&atilde;o
permiss&iacute;veis em grafos orientados. Desde que pares n&atilde;o ordenados
correspondentes n&atilde;o s&atilde;o distintos, entretanto, em um grafo
n&atilde;o orientado poder&aacute; existir no m&aacute;ximo uma extremidade
conectada, um par de v&eacute;rtices. Semelhantemente, desde que os v&eacute;rtices
na extremidade t&ecirc;m que serem distintos, poder&aacute; n&atilde;o
existir uma extremidade de um v&eacute;rtice para ele mesmo. Devemos observar,
contudo, que algumas vezes estas exig&ecirc;ncias levam a permitir m&uacute;ltiplas
extremidades conectadas a um par de v&eacute;rtices e loops infinitos de
v&eacute;rtices conectados a eles mesmos <font color="#FF0000">(self-loops)</font>.</b></td>
</tr>
</table></div>

</body>
</html>
