<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Marcelo Alves de Sales">
   <meta name="GENERATOR" content="Mozilla/4.5 [en] (Win98; I) [Netscape]">
   <title>Untitled</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#FF0000" vlink="#FF0000" alink="#FF0000" background="bg3.jpg" bgproperties="fixed">
<b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

<font size=+1>Aplica&ccedil;&otilde;es dos Grafos</font></b>&nbsp;
<div ALIGN=right><table COLS=1 WIDTH="83%" >
<tr>
<td><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Os grafos acham sua import&acirc;ncia como modelos para muitos tipos de
processos ou estruturas. <font color="#FF0000">Cidades e suas avenidas</font>
conectados formam um grafo, como fazem os <font color="#FF0000">componentes
num circuitos</font> com conec&ccedil;&otilde;es entre eles. Uma <font color="#FF0000">combina&ccedil;&atilde;o
qu&iacute;mica org&acirc;nica</font> pode ser considerado um grafo com
os &aacute;tomos sendo os v&eacute;rtices e os la&ccedil;os entre eles
como extremidades. As <font color="#FF0000">pessoas vivendo em uma cidade</font>
podem ser considerado como v&eacute;rtices de um grafo com o relacionamento
se familiariza com descrevendo as extremidades. <font color="#FF0000">Pessosas
trabalhando</font> em uma corpora&ccedil;&atilde;o formam um grafo orientado
com a rela&ccedil;&atilde;o “supervisa” descrevendo as extremidades. As
mesmas pessoas podiam tamb&eacute;m ser consideradas como um grafo n&atilde;o
orientado, com diferentes extremidades descrevendo rela&ccedil;&otilde;es
“trabalha com". Vejamos mais alguns exemplos:</b></td>
</tr>
</table></div>
&nbsp;
<div ALIGN=right><table COLS=1 WIDTH="83%" >
<tr VALIGN=CENTER>
<td><img SRC="rotas2.gif" height=199 width=224 align=LEFT><b><font size=-1>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</font>&nbsp;
Um grafo pode ser as rotas que os avi&otilde;es alguma companhia fazem
para dislocar pessoas de&nbsp; popula&ccedil;&atilde;o de uma cidade distante
a outra.&nbsp; Aqui no exemplo, a popula&ccedil;&atilde;o do estado de
Alagoas pode pegar um v&ocirc;o tanto para o Rio de Janeiro como para S&atilde;o
paulo, Pernambuco etc. Agoa para irmos de Sergipe para S&atilde;o Paulo,
temos que antes fazermos uma escala em Alagoas para ai sim, chegar-mos
em S&atilde;o Paulo.</b></td>
</tr>
</table></div>
&nbsp;
<div ALIGN=right><table COLS=1 WIDTH="83%" >
<tr>
<td><img SRC="rede.gif" height=116 width=282 align=RIGHT><b><font size=-1>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

</font>Sabemos que uma rede de computadores s&atilde;o as comunica&ccedil;&otilde;es
existentes entre as m&aacute;quinas. Cada qual que requisita algo a outro
e assim por diante. Um grafo tamb&eacute;m pode ser a representa&ccedil;&atilde;o
de uma rede de computadores com as arestas representando o pedido e o recebimento
de informa&ccedil;&otilde;es. O computador A pede informa&ccedil;&otilde;es
tanto a B como a C, o computador C requisita algo para D que recebe informa&ccedil;&otilde;es
de B. Assim por diante.</b></td>
</tr>
</table></div>

<br>&nbsp;
</body>
</html>
